package numbers

import (
	"testing"
)

func TestConvet(t *testing.T) {
	tests := []struct {
		num int
		res string
	}{
		{0, "〇"},
		{1, "一"},
		{2, "二"},
		{3, "三"},
		{4, "四"},
		{5, "五"},
		{6, "六"},
		{7, "七"},
		{8, "八"},
		{9, "九"},
		{10, "一十"},
		{11, "一十一"},
		{100, "一百"},
		{101, "一百〇一"},
		{110, "一百一十"},
		{111, "一百一十一"},
		{1000, "一千"},
		{1001, "一千〇一"},
		{1010, "一千〇一十"},
		{1011, "一千〇一十一"},
		{1100, "一千一百"},
		{1101, "一千一百〇一"},
		{1110, "一千一百一十"},
		{1111, "一千一百一十一"},
		{10001, "一万〇一"},
		{10010, "一万〇一十"},
		{10011, "一万〇一十一"},
		{10100, "一万〇一百"},
		{10101, "一万〇一百〇一"},
		{10110, "一万〇一百一十"},
		{10111, "一万〇一百一十一"},
		{11000, "一万一千"},
		{11001, "一万一千〇一"},
		{11010, "一万一千〇一十"},
		{11011, "一万一千〇一十一"},
		{11100, "一万一千一百"},
		{11101, "一万一千一百〇一"},
		{11110, "一万一千一百一十"},
		{11111, "一万一千一百一十一"},
	}

	for _, test := range tests {
		if res := Convert(test.num); res != test.res {
			t.Errorf("Convert(%d) = %s, want %s\n", test.num, res, test.res)
		}
	}
}
